{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "batch_input_shape": [null, 64, 64, 3], "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000d\u0001\u001b\u0000d\u0002\u0018\u0000S\u0000)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-12-f59015b04a5e>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"name": "cnn1", "trainable": true, "nb_filter": 24, "nb_row": 5, "nb_col": 5, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "cnn2", "trainable": true, "nb_filter": 36, "nb_row": 5, "nb_col": 5, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "cnn3", "trainable": true, "nb_filter": 54, "nb_row": 5, "nb_col": 5, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "cnn4", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "cnn5", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "fc1", "trainable": true, "output_dim": 1164, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 64}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "fc2", "trainable": true, "output_dim": 100, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 1164}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "fc3", "trainable": true, "output_dim": 50, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 100}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "fc4", "trainable": true, "output_dim": 10, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 50}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "fc5", "trainable": true, "output_dim": 1, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 10}}], "keras_version": "1.2.2"}